jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EFM32GGxxx_DFP</name>
  <description>Silicon Labs EFM32 Giant Gecko Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="2.2.0" date="2015-07-31">
      Added EFM32GG900 devices.
      Updated device support files to V4.0.0
      Updated CMSIS drivers:
      - USB Device, USB Host: Updated initialization, uninitialization and power procedures
      - SPI:
      -- Updated initialization, uninitialization and power procedures
      -- Corrected status bit-field race conditions
    </release>
    <release version="2.1.0" date="2014-12-11">
      Updated: 
      - SiliconLabs Content updated to Version 3.20.7
      - USB Host Driver to CMSIS USB Host Driver API v2.01
      Updated Examples:
      - File System component's Configuration file to File System Version 6.2
      - File_Demo and USB Host MassStorage examples updated to use new fdelete() API of File System 6.2
    </release>
    <release version="2.0.0" date="2014-09-09">
      Added CMSIS Driver compatible to API Version 2.0 (SPI, USB Host and Device)
      Added MDK-Middleware Examples for Filesystem, Network, USB and Graphics (EFM32GG_DK3750)
      SiliconLabs Packages included:
      - EM_CMSIS 3.20.6
      - EFM32-CMSIS-SVD_Giant 3.20.5
      - EM_BSP_COMMON 3.20.5
      - emdrv 3.20.5 
      - glib_1.2 3.20.5
      - EFM32GG_DK3750_BSP 3.20.5
      - EFM32GG_STK3700_BSP 3.20.5
      Added Debug Description for trace setup.
    </release>
    <release version="1.0.2" date="2014-02-20">
      Updated emlib 3.20.2
      USB Device driver update: multiple packet read, EP0 unconfiguration
      SPI driver updated: corrected DMA transfer mode and IRQ handling - UART_ macros replaced with correct USART_ variant.
    </release>
    <release version="1.0.1">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.0">
      First Release version of EFM32GG Device Family Pack.
    </release>
  </releases>
 
  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Silicon Labs</keyword>
    <keyword>EFM32GG</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32GG Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <debugconfig swj="false" default="swd" clock="5000000"/>
      <book    name="Documents\dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
      <book    name="Documents\EFM32-Cortex-M3-RM.pdf"                title="EFM32 Cortex-M3 Reference Manual"/>
      <book    name="Documents\EFM32GG-RM.pdf"                        title="EFM32GG Reference Manual"/>
      <description>
Silicon Labs' EFM32™ Giant Gecko ARM Cortex-M3 based 32-bit microcontrollers (MCUs) provide flash memory configurations up to 1024 kB, 128 kB of RAM and CPU speeds up to 48 MHz, making them ideal for energy sensitive applications with high memory and connectivity requirements.
The Giant Gecko MCUs are available in packages down to 7x7 mm, as well as full wafer options, and feature autonomous, low energy peripherals, including AES encryption, pulse counter, low energy UARTs, a low energy sensor interface and on-chip operational amplifiers.

The USB connectivity option is USB 2.0 compliant at full speed (12 Mbps), integrating 2 kB endpoint buffers and handling up to 14 endpoints.
The Giant Gecko MCUs provide support for USB host, device and on-the-go configurations, as well as bootloader over USB.
      </description>

      <feature type="AnalogOther"   n="3"                           name="Operational Amplifier"/>
      <feature type="Other"         n="1"                           name="Low Energy Sensor Interface (LESENSE)"/>

      <!-- <debug> not required, defaults to __dp="0" and __ap="0" -->
      <trace>
        <!-- SWO Trace Support -->
        <serialwire/>
        <!-- TPIU support: 1-bit, 2-bit, and 4-bit traceport -->
        <traceport width="0x0000000B"/>
      </trace>

      <debugvars configfile="Device\EFM32GG\Debug\EFM32GGxxx.dbgconf"> <!-- version="0.0.1"> -->
        __var TraceClkSrc     = 0;  // Clock source for trace clock (0 - System Clock, 1 - Aux Clock)
        __var PinLocationSWO  = 0;  // Pin Locations for SWO pin
        __var PinLocationTPIU = 0;  // Pin Locations for TPIU pins
      </debugvars>

      <sequences>
        
        <!-- ResetHardware: A HW reset also resets the debug interface.
             A debugger needs to be capable of restoring a debug connection.
             Otherwise, the HW reset cannot be used. -->
        
        <!-- Pre-defined Debug Access Sequences -->

        <!-- Begin: TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO  = (__traceout &amp; 0x1) != 0;
            __var traceTPIU = (__traceout &amp; 0x2) != 0;
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");
            </block>
          </control>
        </sequence>
        <!-- End: TraceStart Sequence -->

        <!-- Begin: TraceStop Sequence -->
        <sequence name="TraceStop">
          <block>
            __var traceSWO       = (__traceout &amp; 0x1) != 0;
            __var traceTPIU      = (__traceout &amp; 0x2) != 0;
          </block>

          <control if="traceSWO">
            <block>
              Sequence("DisableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>
        </sequence>
        <!-- End: TraceStop Sequence -->

        
        <!-- User-defined Debug Access Sequences -->
        
        <!-- Begin: SelectTraceClock Sequence -->
        <sequence name="SelectTraceClock">
          <control if="TraceClkSrc == 0">
            <block>
              // Use System Clock for Trace
              Write32(0x400C8000, (Read32(0x400C8000) | (1 &lt;&lt; 28)));  // Set CMU_CTRL.DBGCLK to HFCLK
            </block>
          </control>

          <control if="TraceClkSrc == 1">
            <block>
              // Use AUXHFRCO for Trace
              Write32(0x400C8000, (Read32(0x400C8000) &amp; ~(1 &lt;&lt; 28)));  // Set CMU_CTRL.DBGCLK to AUXHFRCO
            </block>

            <control if="((Read32(0x400C802C) &amp; (1 &lt;&lt; 5)) == 0)">
              <block>
                // Enable AUXHFRCO
                Write32(0x400C8020, (1 &lt;&lt; 4));
              </block>
              <!-- Wait for AUXHFRCO selection to become stable -->
              <control while="(Read32(0x400C802C) &amp; (1 &lt;&lt; 5)) == 0" timeout="1000000"/>
            </control>
            
          </control>
        </sequence>
        <!-- End: SelectTraceClock Sequence -->

