jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
          <control if="PinLocationSWO == 3">
            <block>
              Write32(0x40006070, (Read32(0x40006070) &amp; ~0x000000F0)); // GPIO_PD_MODEL Pin 1 - DISABLED: SWO
            </block>
          </control>
        </sequence>
        <!-- End: DisableTraceSWO Sequence -->

        <!-- Begin: DisableTraceTPIU Sequence -->
        <sequence name="DisableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

            // Disable TPIU trace pins in GPIO_ROUTE
            Write32(0x40006120, (Read32(0x40006120) &amp; ~(0x0001F000)));
          </block>

          <control if="PinLocationTPIU == 0">
            <block>
              Write32(0x40006070, (Read32(0x40006070) &amp; ~0xF0000000)); // GPIO_PD_MODEL Pin 7 - DISABLED: TRACECLK
              Write32(0x40006070, (Read32(0x40006070) &amp; ~0x0F000000)); // GPIO_PD_MODEL Pin 6 - DISABLED: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006070, (Read32(0x40006070) &amp; ~0x0000F000)); // GPIO_PD_MODEL Pin 3 - DISABLED: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x40006070, (Read32(0x40006070) &amp; ~0x000F0000)); // GPIO_PD_MODEL Pin 4 - DISABLED: TRACEDATA2
                Write32(0x40006070, (Read32(0x40006070) &amp; ~0x00F00000)); // GPIO_PD_MODEL Pin 5 - DISABLED: TRACEDATA3
              </block>
            </control>
          </control>

          <control if="PinLocationTPIU == 1">
            <block>
              Write32(0x400060BC, (Read32(0x400060BC) &amp; ~0x0000000F)); // GPIO_PF_MODEH Pin 0 - DISABLED: TRACECLK
              Write32(0x400060BC, (Read32(0x400060BC) &amp; ~0x000000F0)); // GPIO_PF_MODEH Pin 1 - DISABLED: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006074, (Read32(0x40006074) &amp; ~0x00F00000)); // GPIO_PD_MODEH Pin 5 - DISABLED: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x4000602C, (Read32(0x4000602C) &amp; ~0xF0000000)); // GPIO_PB_MODEH Pin 7 - DISABLED: TRACEDATA2
                Write32(0x400060B8, (Read32(0x400060B8) &amp; ~0x0000F000)); // GPIO_PF_MODEL Pin 3 - DISABLED: TRACEDATA3
              </block>
            </control>
          </control>

          <control if="PinLocationTPIU == 2">
            <block>
              Write32(0x4000604C, (Read32(0x4000604C) &amp; ~0x0F000000)); // GPIO_PC_MODEL Pin 6 - DISABLED: TRACECLK
              Write32(0x4000604C, (Read32(0x4000604C) &amp; ~0xF0000000)); // GPIO_PC_MODEL Pin 7 - DISABLED: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006070, (Read32(0x40006070) &amp; ~0x0000F000)); // GPIO_PD_MODEL Pin 3 - DISABLED: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x40006070, (Read32(0x40006070) &amp; ~0x000F0000)); // GPIO_PD_MODEL Pin 4 - DISABLED: TRACEDATA2
                Write32(0x40006070, (Read32(0x40006070) &amp; ~0x00F00000)); // GPIO_PD_MODEL Pin 5 - DISABLED: TRACEDATA3
              </block>
            </control>
          </control>

          <control if="PinLocationTPIU == 3">
            <block>
              Write32(0x40006004, (Read32(0x40006004) &amp; ~0x0F000000)); // GPIO_PA_MODEL Pin 6 - DISABLED: TRACECLK
              Write32(0x40006004, (Read32(0x40006004) &amp; ~0x00000F00)); // GPIO_PA_MODEL Pin 2 - DISABLED: TRACEDATA0
            </block>
            <control if="tracePortWidth &gt;= 2">
              <block>
                Write32(0x40006004, (Read32(0x40006004) &amp; ~0x0000F000)); // GPIO_PA_MODEL Pin 3 - DISABLED: TRACEDATA1
              </block>
            </control>
            <control if="tracePortWidth &gt;= 4">
              <block>
                Write32(0x40006004, (Read32(0x40006004) &amp; ~0x000F0000)); // GPIO_PA_MODEL Pin 4 - DISABLED: TRACEDATA2
                Write32(0x40006004, (Read32(0x40006004) &amp; ~0x00F00000)); // GPIO_PA_MODEL Pin 5 - DISABLED: TRACEDATA3
              </block>
            </control>
          </control>
        </sequence>
        <!-- End: DisableTraceTPIU Sequence -->

      </sequences>

      <!-- ************************  Subfamily 'EFM32GG995'  **************************** -->
      <subFamily DsubFamily="EFM32GG995">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG995.pdf"                      title="EFM32GG995 Data Sheet"/>
        <book    name="Documents\EFM32GG995-errata.pdf"               title="EFM32GG995 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg995-errata-history.pdf"       title="EFM32GG995 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG995F1024'  ***************************** -->
      <device Dname="EFM32GG995F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG995F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG995F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
