jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
        <!-- *************************  Device 'EFM32GG900F1024'  ***************************** -->
        <device Dname="EFM32GG900F1024">
          <processor Dclock="48000000"/>
          <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG900F1024"/>
          <debug svd="SVD\EFM32GG\EFM32GG900F1024.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
        
        <!-- *************************  Device 'EFM32GG900F512'  ***************************** -->
        <device Dname="EFM32GG900F512">
          <processor Dclock="48000000"/>
          <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG900F512"/>
          <debug svd="SVD\EFM32GG\EFM32GG900F512.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG895'  **************************** -->
      <subFamily DsubFamily="EFM32GG895">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG895.pdf"                      title="EFM32GG895 Data Sheet"/>
        <book    name="Documents\EFM32GG895-errata.pdf"               title="EFM32GG895 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg895-errata-history.pdf"       title="EFM32GG895 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG895F512'  ***************************** -->
      <device Dname="EFM32GG895F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG895F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG895F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG895F1024'  ***************************** -->
      <device Dname="EFM32GG895F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG895F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG895F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG890'  **************************** -->
      <subFamily DsubFamily="EFM32GG890">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="IOs"           n="90"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG890.pdf"                      title="EFM32GG890 Data Sheet"/>
        <book    name="Documents\EFM32GG890-errata.pdf"               title="EFM32GG890 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg890-errata-history.pdf"       title="EFM32GG890 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG890F1024'  ***************************** -->
      <device Dname="EFM32GG890F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG890F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG890F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG890F512'  ***************************** -->
      <device Dname="EFM32GG890F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG890F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG890F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG880'  **************************** -->
      <subFamily DsubFamily="EFM32GG880">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="IOs"           n="86"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG880.pdf"                      title="EFM32GG880 Data Sheet"/>
        <book    name="Documents\EFM32GG880-errata.pdf"               title="EFM32GG880 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg880-errata-history.pdf"       title="EFM32GG880 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG880F1024'  ***************************** -->
      <device Dname="EFM32GG880F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG880F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG880F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG880F512'  ***************************** -->
      <device Dname="EFM32GG880F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG880F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG880F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

