jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
      <!-- ************************  Subfamily 'EFM32GG842'  **************************** -->
      <subFamily DsubFamily="EFM32GG842">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="IOs"           n="53"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG842.pdf"                      title="EFM32GG842 Data Sheet"/>
        <book    name="Documents\EFM32GG842-errata.pdf"               title="EFM32GG842 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg842-errata-history.pdf"       title="EFM32GG842 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG842F1024'  ***************************** -->
      <device Dname="EFM32GG842F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG842F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG842F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG842F512'  ***************************** -->
      <device Dname="EFM32GG842F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG842F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG842F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG840'  **************************** -->
      <subFamily DsubFamily="EFM32GG840">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="IOs"           n="56"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG840.pdf"                      title="EFM32GG840 Data Sheet"/>
        <book    name="Documents\EFM32GG840-errata.pdf"               title="EFM32GG840 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg840-errata-history.pdf"       title="EFM32GG840 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG840F1024'  ***************************** -->
      <device Dname="EFM32GG840F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG840F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG840F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG840F512'  ***************************** -->
      <device Dname="EFM32GG840F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG840F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG840F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG395'  **************************** -->
      <subFamily DsubFamily="EFM32GG395">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG395.pdf"                      title="EFM32GG395 Data Sheet"/>
        <book    name="Documents\EFM32GG395-errata.pdf"               title="EFM32GG395 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg395-errata-history.pdf"       title="EFM32GG395 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG395F1024'  ***************************** -->
      <device Dname="EFM32GG395F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG395F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG395F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG395F512'  ***************************** -->
      <device Dname="EFM32GG395F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG395F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG395F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

