jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
      <!-- *************************  Device 'EFM32GG330F1024'  ***************************** -->
      <device Dname="EFM32GG330F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG330F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG330F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG330F512'  ***************************** -->
      <device Dname="EFM32GG330F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG330F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG330F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG295'  **************************** -->
      <subFamily DsubFamily="EFM32GG295">
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG295.pdf"                      title="EFM32GG295 Data Sheet"/>
        <book    name="Documents\EFM32GG295-errata.pdf"               title="EFM32GG295 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg295-errata-history.pdf"       title="EFM32GG295 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG295F1024'  ***************************** -->
      <device Dname="EFM32GG295F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG295F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG295F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG295F512'  ***************************** -->
      <device Dname="EFM32GG295F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG295F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG295F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG290'  **************************** -->
      <subFamily DsubFamily="EFM32GG290">
        <feature type="IOs"           n="90"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG290.pdf"                      title="EFM32GG290 Data Sheet"/>
        <book    name="Documents\EFM32GG290-errata.pdf"               title="EFM32GG290 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg290-errata-history.pdf"       title="EFM32GG290 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG290F1024'  ***************************** -->
      <device Dname="EFM32GG290F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG290F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG290F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG290F512'  ***************************** -->
      <device Dname="EFM32GG290F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG290F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG290F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG280'  **************************** -->
      <subFamily DsubFamily="EFM32GG280">
        <feature type="IOs"           n="86"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG280.pdf"                      title="EFM32GG280 Data Sheet"/>
        <book    name="Documents\EFM32GG280-errata.pdf"               title="EFM32GG280 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg280-errata-history.pdf"       title="EFM32GG280 Errata History"/>
      
