jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
      <!-- *************************  Device 'EFM32GG280F1024'  ***************************** -->
      <device Dname="EFM32GG280F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG280F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG280F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG280F512'  ***************************** -->
      <device Dname="EFM32GG280F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG280F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG280F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG232'  **************************** -->
      <subFamily DsubFamily="EFM32GG232">
        <feature type="IOs"           n="53"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG232.pdf"                      title="EFM32GG232 Data Sheet"/>
        <book    name="Documents\EFM32GG232-errata.pdf"               title="EFM32GG232 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg232-errata-history.pdf"       title="EFM32GG232 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG232F1024'  ***************************** -->
      <device Dname="EFM32GG232F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG232F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG232F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG232F512'  ***************************** -->
      <device Dname="EFM32GG232F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG232F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG232F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG230'  **************************** -->
      <subFamily DsubFamily="EFM32GG230">
        <feature type="IOs"           n="56"                          name="General Purpose I/O pins"/>
        <book    name="Documents\EFM32GG230.pdf"                      title="EFM32GG230 Data Sheet"/>
        <book    name="Documents\EFM32GG230-errata.pdf"               title="EFM32GG230 Errata, Chip rev. D"/>
        <book    name="Documents\efm32gg230-errata-history.pdf"       title="EFM32GG230 Errata History"/>
      
      <!-- *************************  Device 'EFM32GG230F1024'  ***************************** -->
      <device Dname="EFM32GG230F1024">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG230F1024"/>
        <debug svd="SVD\EFM32GG\EFM32GG230F1024.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x100000"   RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      
      <!-- *************************  Device 'EFM32GG230F512'  ***************************** -->
      <device Dname="EFM32GG230F512">
        <processor Dclock="48000000"/>
        <compile header="Device\EFM32GG\Include\em_device.h"  define="EFM32GG230F512"/>
        <debug svd="SVD\EFM32GG\EFM32GG230F512.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\EFM32GG.FLM"        start="0x00000000"  size="0x80000"    RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Silicon Labs" name="EFM32GG-DK3750" revision="Ver 1.0">
      <description>Silicon Labs EFM32GG-DK3750 Development Kit</description>
      <book category="manual"    name="Documents\efm32gg-dk3750-ug.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32GG990F1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32GG990"/>
    </board>
    <board vendor="Silicon Labs" name="EFM32GG-STK3700" revision="Ver 1.0">
      <description>Silicon Labs EFM32GG-STK3700 Starter Kit</description>
      <book category="manual"    name="Documents\efm32gg-stk3700-ug.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32GG990F1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32GG990"/>
    </board>
  </boards>

