jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
  <conditions> <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="EFM32GG Device">
      <description>Silicon Labs EFM32 device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32GG*"/>
    </condition>
    <condition id="EFM32GG990 Device">
      <description>Silicon Labs EFM32 device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32GG990*"/>
    </condition>

    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib EMU">
      <description>Silicon Labs emlib with EMU</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EMU"/>
    </condition>
    <condition id="emlib CMU">
      <description>Silicon Labs emlib with CMU</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
    </condition>
    <condition id="emlib CMU GPIO">
      <description>Silicon Labs emlib with CMU and GPIO</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
    </condition>
    <condition id="emlib CMU INT">
      <description>Silicon Labs emlib with CMU and INT</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="INT"/>
    </condition>

    <condition id="emdrv GPIOINT">
      <description>Silicon Labs Driver GPIOINT</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="INT"/>
    </condition>
    <condition id="emdrv NVM">
      <description>Silicon Labs Driver NVM</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="MSC"/>
    </condition>
    <condition id="emdrv RTCDRV">
      <description>Silicon Labs Driver RTCDRV</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="INT"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="RTC"/>
    </condition>
    <condition id="emdrv SLEEP">
      <description>Silicon Labs Driver SLEEP</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="INT"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="RMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EMU"/>
    </condition>
    <condition id="emdrv SPIDRV">
      <description>Silicon Labs Driver SPIDRV</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="INT"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="DMA"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="USART"/>
      <require Cclass="Device"        Cgroup="emdrv"   Csub="RTCDRV"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="DmaCtrl"/>
    </condition>

    <condition id="glib CORE">
      <description>glib CORE</description>
      <require condition="EFM32GG Device"/> <!-- Giant Gecko only -->
      <require Cclass="Graphics"      Cgroup="Display Driver"/>
    </condition>
    <condition id="glib Driver DISPLAY">
      <description>glib Display Driver</description>
      <require condition="EFM32GG Device"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Display"/>
    </condition>
    <condition id="glib Driver SSD2119 16-bit">
      <description>glib Display Driver SSD2119 16-bit IF</description>
      <require condition="EFM32GG Device"/>
      <require Cclass="Board Support" Cgroup="CORE"/>
    </condition>
  <!-- Not available on Giant Gecko DK and STK
    <condition id="glib Driver SSD2119 18-bit">
      <description>glib Display Driver SSD2119 18-bit IF</description>
      <require condition="EFM32GG Device"/>
    </condition>
    <condition id="glib Driver SSD2119 SPI">
      <description>glib Display Driver SSD2119 SPI IF</description>
      <require condition="EFM32GG Device"/>
    </condition>
  -->
    <condition id="glib Driver SSD2119 RGB">
      <description>glib Display Driver SSD2119 RGB IF</description>
      <require condition="EFM32GG Device"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="USART"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Tft" Cvariant="RGB"/>
    </condition>

    <condition id="EFM32GG CMSIS Device">
      <description>Silicon Labs Giant Gecko device series and CMSIS Core</description>
      <require condition="EFM32GG Device"/>
      <require Cclass="CMSIS"        Cgroup="CORE"/>
    </condition>

    <condition id="EFM32GG CMSIS GPIO CMU">
      <description>EFM32GG with CMSIS and emlib: GPIO, CMU</description>
      <require condition="EFM32GG CMSIS Device"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
    </condition>
    <condition id="EFM32GG CMSIS GPIO CMU DMA">
      <description>EFM32GG with CMSIS and emlib: GPIO, CMU, DMA</description>
      <require condition="EFM32GG CMSIS Device"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="DMA"/>
    </condition>

    <condition id="EFM32GG DK3750">
      <description>EFM32GG DK3750 Board Support Core</description>
      <require condition="EFM32GG990 Device"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EBI"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="MSC"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="USART"/>
    </condition>
    <condition id="EFM32GG STK3700">
      <description>EFM32GG STK3700 Board Support Core</description>
      <require condition="EFM32GG990 Device"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EBI"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="MSC"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="USART"/>
    </condition>

    <condition id="EFM32GG BSP">
      <description>EFM32GG Board Support Package</description>
      <require condition="EFM32GG990 Device"/>
      <require Cclass="Board Support" Cgroup="CORE"/>
    </condition>
    <condition id="EFM32GG BSP ADC">
      <description>EFM32GG BSP with ADC</description>
      <require condition="EFM32GG990 Device"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="ADC"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Board Support" Cgroup="CORE"/>
    </condition>
    <condition id="EFM32GG BSP EEPROM">
      <description>EFM32GG BSP with EEPROM</description>
      <require condition="EFM32GG990 Device"/>
      <require Cclass="Board Support" Cgroup="CORE"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Eeprom"/>
    </condition>
