jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
    <condition id="BSP Driver Si7013">
      <description>BSP Driver Si7013</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: DK3750 -->
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I2cSpm"/>
    </condition>
    <condition id="BSP Driver TempSensor">
      <description>BSP Driver TempSensor</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: DK3750 -->
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I2cSpm"/>
    </condition>
    <condition id="BSP Driver TextDisplay">
      <description>BSP Driver TextDisplay</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: STK3700 -->
      <require Cclass="Board Support" Cgroup="CORE"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Display"/>
    </condition>
    <condition id="BSP Driver Tft EBI">
      <description>BSP Driver Tft (EBI)</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: DK3750 -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="EBI"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="CORE"/>
      <require Cclass="Graphics"      Cgroup="Display Driver" Cvariant="*-bit IF"/>
    </condition>
    <condition id="BSP Driver Tft RGB">
      <description>BSP Driver Tft (RGB)</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: DK3750 -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="EBI"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="USART"/>
      <require Cclass="Board Support" Cgroup="CORE"/>
      <require Cclass="Graphics"      Cgroup="Display Driver" Cvariant="*RGB IF"/>
    </condition>
    <condition id="BSP Driver Touch">
      <description>BSP Driver Touch</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: DK3750 -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="ADC"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I2cSpm"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Eeprom"/>
    </condition>
    <condition id="BSP Driver Udelay">
      <description>BSP Driver Udelay</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: DK3750, STK3700 -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="INT"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="RTC"/>
    </condition>
    <condition id="BSP Driver VddCheck">
      <description>BSP Driver VddCheck</description>
      <require condition="EFM32GG990 Device"/> <!-- EFM32GG990: DK3750, STK3700 -->
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="VCMP"/>
    </condition>
  </conditions>

  <taxonomy>
    <description Cclass="Device"        Cgroup="emlib"   doc="emlib\doc\html\index.html"                        >Silicon Labs EFM32 emlib Peripheral Library</description>
    <description Cclass="Device"        Cgroup="emdrv"   doc="emdrv\emdrvdoc\html\index.html"                   >Silicon Labs Drivers</description>
    <description Cclass="Board Support" Cgroup="Drivers" doc="Boards\SiliconLabs\common\bspdoc\html\index.html" >Silicon Labs BSP Drivers</description>
  </taxonomy>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="4.0.0" condition="EFM32GG CMSIS Device">
      <description>System Startup for Silicon Labs EFM32GG device series</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device\EFM32GG\Include\"/>
        <file category="header"  name="Device\EFM32GG\Include\em_device.h"/>
        <!-- startup files -->
        <file category="source"  name="Device\EFM32GG\Source\ARM\startup_efm32gg.s" condition="ARMCC" attr="config" version="4.0.0"/>
        <file category="source"  name="Device\EFM32GG\Source\GCC\startup_efm32gg.S" condition="GCC"   attr="config" version="4.0.0"/>
        <!-- system file -->
        <file category="source"  name="Device\EFM32GG\Source\system_efm32gg.c" attr="config" version="4.0.0"/>
        <!-- device configuration required by drivers at the moment -->
        <file category="header"  name="RTE_Driver\Config\RTE_Device.h" attr="config" version="2.00"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="emlib" Csub="Framework" Cversion="4.0.0" condition="EFM32GG Device">
      <description>emlib Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="header"  name="emlib\inc\em_common.h"/>
        <file category="header"  name="emlib\inc\em_chip.h"/>
        <file category="header"  name="emlib\inc\em_bitband.h"/>
        <file category="header"  name="emlib\inc\em_version.h"/>
        <file category="header"  name="emlib\inc\em_assert.h"/>
        <file category="source"  name="emlib\src\em_assert.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="ACMP" Cversion="4.0.0" condition="emlib Framework">
      <description>Analog comparator (ACMP) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_ACMP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__ACMP.html"/>
        <file category="header"  name="emlib\inc\em_acmp.h"/>
        <file category="source"  name="emlib\src\em_acmp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="ADC" Cversion="4.0.0" condition="emlib CMU">
      <description>Analog to Digital Converter (ADC) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_ADC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__ADC.html"/>
        <file category="header"  name="emlib\inc\em_adc.h"/>
        <file category="source"  name="emlib\src\em_adc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="AES" Cversion="4.0.0" condition="emlib Framework">
      <description>Advanced Encryption Standard Accelerator (AES) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_AES
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__AES.html"/>
        <file category="header"  name="emlib\inc\em_aes.h"/>
        <file category="source"  name="emlib\src\em_aes.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="BURTC" Cversion="4.0.0" condition="emlib Framework">
      <description>Backup Real Time Counter (BURTC) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_BURTC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__BURTC.html"/>
        <file category="header"  name="emlib\inc\em_burtc.h"/>
        <file category="source"  name="emlib\src\em_burtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="CMU" Cversion="4.0.0" condition="emlib EMU">
      <description>Clock management unit (CMU) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_CMU
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__CMU.html"/>
        <file category="header"  name="emlib\inc\em_cmu.h"/>
        <file category="source"  name="emlib\src\em_cmu.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="DAC" Cversion="4.0.0" condition="emlib CMU">
      <description>Digital to Analog Coversion (DAC) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_DAC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__DAC.html"/>
        <file category="header"  name="emlib\inc\em_dac.h"/>
        <file category="source"  name="emlib\src\em_dac.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="DBG" Cversion="4.0.0" condition="emlib CMU GPIO">
      <description>Debug (DBG) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_DBG
      </RTE_Components_h>
      <files>
        <file category="header"  name="emlib\inc\em_dbg.h"/>
        <file category="source"  name="emlib\src\em_dbg.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="DMA" Cversion="4.0.0" condition="emlib CMU">
      <description>Direct Memory Access (DMA) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__DMA.html"/>
        <file category="header"  name="emlib\inc\em_dma.h"/>
        <file category="source"  name="emlib\src\em_dma.c"/>
      </files>
    </component>
