jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="emlib" Csub="EBI" Cversion="4.0.0" condition="emlib Framework">
      <description>EBI External Bus Interface (EBI) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_EBI
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__EBI.html"/>
        <file category="header"  name="emlib\inc\em_ebi.h"/>
        <file category="source"  name="emlib\src\em_ebi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="EMU" Cversion="4.0.0" condition="emlib CMU">
      <description>Energy Management Unit (EMU) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_EMU
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__EMU.html"/>
        <file category="header"  name="emlib\inc\em_emu.h"/>
        <file category="source"  name="emlib\src\em_emu.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="GPIO" Cversion="4.0.0" condition="emlib Framework">
      <description>General Purpose Input/Output (GPIO) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_GPIO
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__GPIO.html"/>
        <file category="header"  name="emlib\inc\em_gpio.h"/>
        <file category="source"  name="emlib\src\em_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="I2C" Cversion="4.0.0" condition="emlib CMU">
      <description>Inter-integrated Circuit (I2C) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_I2C
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__I2C.html"/>
        <file category="header"  name="emlib\inc\em_i2c.h"/>
        <file category="source"  name="emlib\src\em_i2c.c"/>
      </files>
    </component>
<!-- Not available on Giant Gecko
    <component Cclass="Device" Cgroup="emlib" Csub="IDAC" Cversion="4.0.0" condition="emlib CMU">
      <description>Current Digital to Analog Converter (IDAC) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_IDAC
      </RTE_Components_h>
      <files>
        <file category="header"  name="emlib\inc\em_idac.h"/>
        <file category="source"  name="emlib\src\em_idac.c"/>
      </files>
    </component>
-->
    <component Cclass="Device" Cgroup="emlib" Csub="INT" Cversion="4.0.0" condition="emlib Framework">
      <description>Safe nesting interrupt disable/enable</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_INT
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__INT.html"/>
        <file category="header"  name="emlib\inc\em_int.h"/>
        <file category="source"  name="emlib\src\em_int.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="LCD" Cversion="4.0.0" condition="emlib Framework">
      <description>Liquid Crystal Display (LCD) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_LCD
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__LCD.html"/>
        <file category="header"  name="emlib\inc\em_lcd.h"/>
        <file category="source"  name="emlib\src\em_lcd.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="LESENSE" Cversion="4.0.0" condition="emlib CMU">
      <description>Low Energy Sensor (LESENSE) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_LESENSE
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__LESENSE.html"/>
        <file category="header"  name="emlib\inc\em_lesense.h"/>
        <file category="source"  name="emlib\src\em_lesense.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="LETIMER" Cversion="4.0.0" condition="emlib CMU">
      <description>Low Energy Timer (LETIMER) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_LETIMER
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__LETIMER.html"/>
        <file category="header"  name="emlib\inc\em_letimer.h"/>
        <file category="source"  name="emlib\src\em_letimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="LEUART" Cversion="4.0.0" condition="emlib CMU">
      <description>Low Energy Universal Asynchronous Receiver/Transmitter (LEUART) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_LEUART
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__LEUART.html"/>
        <file category="header"  name="emlib\inc\em_leuart.h"/>
        <file category="source"  name="emlib\src\em_leuart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="MPU" Cversion="4.0.0" condition="emlib Framework">
      <description>Memory Protection Unit (MPU) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_MPU
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__MPU.html"/>
        <file category="header"  name="emlib\inc\em_mpu.h"/>
        <file category="source"  name="emlib\src\em_mpu.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="MSC" Cversion="4.0.0" condition="emlib CMU INT">
      <description>Flash controller (MSC) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_MSC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__MSC.html"/>
        <file category="header"  name="emlib\inc\em_msc.h"/>
        <file category="source"  name="emlib\src\em_msc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="OPAMP" Cversion="4.0.0" condition="emlib SYSTEM">
      <description>Operational Amplifier (OPAMP) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_OPAMP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__OPAMP.html"/>
        <file category="header"  name="emlib\inc\em_opamp.h"/>
        <file category="source"  name="emlib\src\em_opamp.c"/>
      </files>
    </component>
