jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1" Cversion="2.3" condition="EFM32GG CMSIS GPIO CMU">
      <description>USB Device Driver for EFM32GG Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source"  name="RTE_Driver\USB_EFM32GGxxx.c"/>
        <file category="source"  name="RTE_Driver\USBD_EFM32GGxxx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.0" Cversion="2.4" condition="EFM32GG CMSIS GPIO CMU">
      <description>USB Host Driver for EFM32GG Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source"  name="RTE_Driver\USB_EFM32GGxxx.c"/>
        <file category="source"  name="RTE_Driver\USBH_EFM32GGxxx.c"/>
      </files>
    </component>

    <bundle Cbundle="EFM32GG DFP" Cclass="Graphics" Cversion="3.20.5">
      <description>Silicon Labs Graphics Library</description>
      <doc></doc>
      <component Cgroup="CORE" condition="glib CORE">
        <description>glib CORE</description>
        <RTE_Components_h>
          #define RTE_GLIB_CORE
        </RTE_Components_h>
        <files>
          <file category="include" name="glib\"/>
          <file category="header"  name="glib\glib\glib.h"/>
          <file category="source"  name="glib\glib\glib.c"/>
          <file category="source"  name="glib\glib\glib_bitmap.c"/>
          <file category="source"  name="glib\glib\glib_circle.c"/>
          <file category="source"  name="glib\glib\glib_line.c"/>
          <file category="source"  name="glib\glib\glib_polygon.c"/>
          <file category="source"  name="glib\glib\glib_rectangle.c"/>
          <file category="source"  name="glib\glib\glib_string.c"/>
          <file category="source"  name="glib\glib\glib_font_narrow_6x8.c"/>
          <file category="source"  name="glib\glib\glib_font_normal_8x8.c"/>
          <file category="source"  name="glib\glib\glib_font_number_16x20.c"/>
          <file category="source"  name="glib\glib\bmp.c"/>
        </files>
      </component>
      <component Cgroup="Display Driver" Cvariant="DISPLAY" condition="glib Driver DISPLAY">
        <description>glib Display Driver</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER
        </RTE_Components_h>
        <files>
          <file category="include" name="glib\"/>
          <file category="include" name="glib\dmd\"/>
          <file category="source"  name="glib\dmd\display\dmd_display.c"/>
        </files>
      </component>
      <component Cgroup="Display Driver" Cvariant="SSD2119 16-bit IF" condition="glib Driver SSD2119 16-bit">
        <description>glib Display Driver SSD2119 16-bit Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_16
        </RTE_Components_h>
        <files>
          <file category="include" name="glib\"/>
          <file category="source"  name="glib\dmd\ssd2119\dmd_ssd2119_16bit.c"/>
          <file category="source"  name="glib\dmd\ssd2119\dmdif_ssd2119_ebi16.c"/>
        </files>
      </component>
<!-- Not available on Giant Gecko DK and STK
      <component Cgroup="Display Driver" Cvariant="SSD2119 18-bit IF" condition="glib Driver SSD2119 18-bit">
        <description>glib Display Driver SSD2119 18-bit Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_18
        </RTE_Components_h>
        <files>
          <file category="include" name="glib\"/>
          <file category="source"  name="glib\dmd\ssd2119\dmd_ssd2119.c"/>
          <file category="source"  name="glib\dmd\ssd2119\dmdif_ssd2119_ebi.c"/>
        </files>
      </component>
      <component Cgroup="Display Driver" Cvariant="SSD2119 SPI IF" condition="glib Driver SSD2119 SPI">
        <description>glib Display Driver SSD2119 SPI Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_SPI
        </RTE_Components_h>
        <files>
          <file category="include" name="glib\"/>
          <file category="source"  name="glib\dmd\ssd2119\dmd_ssd2119.c"/>
          <file category="source"  name="glib\dmd\ssd2119\dmdif_ssd2119_spi.c"/>
        </files>
      </component>
-->
      <component Cgroup="Display Driver" Cvariant="SSD2119 RGB IF" condition="glib Driver SSD2119 RGB">
        <description>glib Display Driver SSD2119 RGB Interface</description>
        <RTE_Components_h>
          #define RTE_GLIB_DISPLAY_DRIVER_SSD2119_RGB
        </RTE_Components_h>
        <files>
          <file category="include" name="glib\"/>
          <file category="source"  name="glib\dmd\ssd2119\dmd_ssd2119_direct.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="EFM32GG-DK3750" Cclass="Board Support" Cversion="4.0.0">
      <description>Silicon Labs EFM32GG-DK3750 Development Kit</description>
      <doc>Documents\efm32gg-dk3750-ug.pdf</doc>

      <component Cgroup="CORE" condition="EFM32GG DK3750">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DK3750
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\index.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\bsp\bsp.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_dk_3201.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_dk_leds.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_dk_mcuboard.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\bsp\bsp_trace.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\bsp\bsp_trace.c"/>
          <file category="include" name="Boards\SiliconLabs\EFM32GG_DK3750\config\"/>
        </files>
      </component>

<!-- Not available on Giant Gecko DK and STK
      <component Cgroup="Drivers" Csub="CapSense" Cvariant="Standard" condition="BSP Driver CapSense">
        <description>CapSense Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__CapSense.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\capsense.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\capsense.c"/>
        </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="DmaCtrl" condition="BSP Driver DmaCtrl">
        <description>DmaCtrl Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_DMACTRL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__DmaCtrl.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\dmactrl.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\dmactrl.c"/>
        </files>
      </component>
