jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
      <component Cgroup="Drivers" Csub="Eeprom" condition="BSP Driver Eeprom">
        <description>Eeprom Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_EEPROM
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Eeprom.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\eeprom.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I2cSpm" condition="BSP Driver I2cSpm">
        <description>I2cSpm Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_I2C
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__I2CSPM.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\i2cspm.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\i2cspm.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Ksz8851snl SPI" condition="BSP Driver Ksz8851snl SPI">
        <description>Ksz8851snl SPI Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_KSZ8851SNL_SPI
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__ksz8851snl.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\ksz8851snl_spi.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\ksz8851snl_spi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Ksz8851snl" condition="BSP Driver Ksz8851snl">
        <description>Ksz8851snl Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_KSZ8851SNL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__ksz8851snl.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\ksz8851snl.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\ksz8851snl.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NorFlash" condition="BSP Driver NorFlash">
        <description>NorFlash Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_NORFLASH
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__NorFlash.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\norflash.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\norflash.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RetargetIo" Cvariant="Serial" condition="BSP Driver RetargetIo Serial">
        <description>RetargetIo Driver (Serial)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RETARGETIO_SERIAL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__RetargetIo.html"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargetio.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\retargetserial.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargetserial.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RetargetIo" Cvariant="Tft" condition="BSP Driver RetargetIo Tft">
        <description>RetargetIo Driver (Tft)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RETARGETIO_TFT
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__RetargetIo.html"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargetio.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\retargettft.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\retargettft.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RtcDrv" condition="BSP Driver RtcDrv">
        <description>RtcDrv Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RTCDRV
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__RtcDrv.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\rtcdrv.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\rtcdrv.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Si114x" condition="BSP Driver Si114x">
        <description>Si114x Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_SI114X
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Si114x.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\si1147_i2c.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\si1147_i2c.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\si114x_algorithm.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\si114x_algorithm.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\si114x_functions.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Si7013" condition="BSP Driver Si7013">
        <description>Si7013 Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_SI7013
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Si7013.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\si7013.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\si7013.c"/>
        </files>
      </component>
