jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32GGxxx_DFP.2.2.0.pdsc
      <component Cgroup="Drivers" Csub="TempSensor" condition="BSP Driver TempSensor">
        <description>TempSensor Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TEMPSENSOR
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__TempSensor.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\tempsens.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\tempsens.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Tft" Cvariant="EBI" condition="BSP Driver Tft EBI">
        <description>Tft Driver (EBI)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TFT_EBI
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Tft.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\tftamapped.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\tftamapped.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Tft" Cvariant="RGB" condition="BSP Driver Tft RGB">
        <description>Tft Driver (RGB)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TFT_RGB
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Tft.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\tftdirect.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\tftdirect.c"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\tftspi.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\tftspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch" condition="BSP Driver Touch">
        <description>Touch Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TOUCH
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Touch.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\touch.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\touch.c"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\calibrate.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Udelay" condition="BSP Driver Udelay">
        <description>Udelay Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_UDELAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__Udelay.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\udelay.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\udelay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="VddCheck" condition="BSP Driver VddCheck">
        <description>VddCheck Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_VDDCHECK
        </RTE_Components_h>
        <files>
          <file category="doc"     name="Boards\SiliconLabs\common\bspdoc\html\group__VddCheck.html"/>
          <file category="header"  name="Boards\SiliconLabs\common\drivers\vddcheck.h"/>
          <file category="source"  name="Boards\SiliconLabs\common\drivers\vddcheck.c"/>
        </files>
      </component>

      <component Cgroup="A/D Converter" condition="EFM32GG BSP ADC">
        <description>A/D Converter interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\ADC_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="LED" condition="EFM32GG BSP">
        <description>LED interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\LED_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="EFM32GG BSP">
        <description>Buttons interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\Buttons_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" condition="EFM32GG BSP">
        <description>Joystick interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\Joystick_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" condition="EFM32GG BSP GLIB TFT">
        <description>Graphic LCD interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="header"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\GLCD_Config.h"/>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\GLCD_Fonts.c"/>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\GLCD_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="16-bit IF" condition="EFM32GG BSP">
        <description>emWin LCD 16-bit Interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="include" name="glib\dmd\ssd2119\"/>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\LCDConf_16.c" attr="config" version="5.00"/>
          <file category="source"  name="Boards\SiliconLabs\EFM32GG_DK3750\Common\LCD_X_16.c"/>
        </files>
      </component>
